WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Set baud rate for a UART port
 */
static int wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud)
{
  uint32_t divisor;
  uint8_t baud1, baud0, pres;
  int ret;

  /* Calculate baud rate divisor
   * Baud = Crystal_Freq / (PRES * (BAUD1*256 + BAUD0) * 16)
   * For simplicity, we'll use PRES = 1
   */
  divisor = WK2132_CRYSTAL_FREQ / (baud * 16);

  if (divisor > 0xFFFF)
    {
      /* Use prescaler */
      pres = 4;
      divisor = WK2132_CRYSTAL_FREQ / (baud * 16 * 4);
    }
  else
    {
      pres = 1;
    }

  if (divisor > 0xFFFF)
    {
      return -EINVAL;  /* Baud rate too low */
    }

  baud1 = (divisor >> 8) & 0xFF;
  baud0 = divisor & 0xFF;

  /* Select sub-page 1 for baud rate configuration */
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* Set baud rate registers */
  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD1, baud1);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD0, baud0);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_PRES, pres);
  if (ret < 0)
    {
      return ret;
    }

  /* Return to sub-page 0 */
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);

  return ret;
}

/**
 * @brief Polling worker function
 */
static void wk2132_poll_worker(FAR void *arg)
{
  int i;

  /* Poll all registered devices */
  for (i = 0; i < g_wk2132_device_count; i++)
    {
      FAR struct uart_dev_s *dev = g_wk2132_devices[i];
      if (dev != NULL)
        {
          /* Check for received data */
          if (wk2132_rxavailable(dev))
            {
              uart_recvchars(dev);
            }

          /* Check for transmit ready */
          if (dev->xmit.head != dev->xmit.tail && wk2132_txready(dev))
            {
              uart_xmitchars(dev);
            }
        }
    }

  /* Schedule next poll */
  if (g_wk2132_poll_started)
    {
      work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL,
                 MSEC2TICK(10));  /* Poll every 10ms */
    }
}

/**
 * @brief Setup UART port
 */
static int wk2132_setup(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t lcr = 0;
  uint8_t gena;
  int ret;

  /* Take exclusive access */
  ret = nxsem_wait(&priv->exclsem);
  if (ret < 0)
    {
      return ret;
    }

  /* Read current global enable register */
  ret = wk2132_i2c_read_global(priv, WK2132_GENA, &gena);
  if (ret < 0)
    {
      goto errout;
    }

  /* Enable the UART port in global register */
  uint8_t gena_bit = 1 << (priv->port - 1);
  gena |= gena_bit;
  ret = wk2132_i2c_write_global(priv, WK2132_GENA, gena);
  if (ret < 0)
    {
      goto errout;
    }

  /* Configure LCR based on settings */
  if (priv->nbits == 7)
    {
      lcr |= WK2132_LCR_WLS0;
    }
  else if (priv->nbits == 8)
    {
      lcr |= WK2132_LCR_WLS1;
    }
  else if (priv->nbits == 9)
    {
      lcr |= WK2132_LCR_WLS1 | WK2132_LCR_WLS0;
    }

  if (priv->stopbits2)
    {
      lcr |= WK2132_LCR_STB;
    }

  if (priv->parity == 1)       /* Odd parity */
    {
      lcr |= WK2132_LCR_PAEN;
    }
  else if (priv->parity == 2)  /* Even parity */
    {
      lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM0;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_LCR, lcr);
  if (ret < 0)
    {
      goto errout;
    }

  /* Set baud rate */
  ret = wk2132_set_baud(priv, priv->baud);
  if (ret < 0)
    {
      goto errout;
    }

  /* Enable FIFOs and reset them */
  ret = wk2132_i2c_write_reg(priv, WK2132_FCR, 0x07);
  if (ret < 0)
    {
      goto errout;
    }

  /* Enable RX data available interrupt */
  ret = wk2132_i2c_write_reg(priv, WK2132_SIER, WK2132_SIER_RFTRIG_IEN);
  if (ret < 0)
    {
      goto errout;
    }

  priv->enabled = true;

  /* Start polling if not already started */
  if (!g_wk2132_poll_started)
    {
      g_wk2132_poll_started = true;
      work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL, 0);
    }

errout:
  nxsem_post(&priv->exclsem);
  return ret;
}

/**
 * @brief Shutdown UART port
 */
static void wk2132_shutdown(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t gena;

  /* Disable all interrupts */
  wk2132_i2c_write_reg(priv, WK2132_SIER, 0x00);

  /* Disable the UART port in global register */
  if (wk2132_i2c_read_global(priv, WK2132_GENA, &gena) >= 0)
    {
      uint8_t gena_bit = 1 << (priv->port - 1);
      gena &= ~gena_bit;
      wk2132_i2c_write_global(priv, WK2132_GENA, gena);
    }

  priv->enabled = false;
}

/**
 * @brief Attach interrupt (not used in polled mode)
 */
static int wk2132_attach(FAR struct uart_dev_s *dev)
{
  return OK;
}

/**
 * @brief Detach interrupt (not used in polled mode)
 */
static void wk2132_detach(FAR struct uart_dev_s *dev)
{
  /* Nothing to do */
}

/**
 * @brief IOCTL handler
 */
static int wk2132_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct uart_dev_s *dev = inode->i_private;
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret = OK;

  switch (cmd)
    {
    case TCGETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Return current settings */
        termiosp->c_cflag = 0;

        if (priv->nbits == 7)
          {
            termiosp->c_cflag |= CS7;
          }
        else if (priv->nbits == 8)
          {
            termiosp->c_cflag |= CS8;
          }

        if (priv->stopbits2)
          {
            termiosp->c_cflag |= CSTOPB;
          }

        if (priv->parity == 1)
          {
            termiosp->c_cflag |= PARENB | PARODD;
          }
        else if (priv->parity == 2)
          {
            termiosp->c_cflag |= PARENB;
          }

        /* Set baud rate */
        cfsetispeed(termiosp, priv->baud);
        cfsetospeed(termiosp, priv->baud);
      }
      break;

    case TCSETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Extract new settings */
        priv->baud = cfgetispeed(termiosp);

